[
  {
    "bookId": 1,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://i.ibb.co.com/khHN7Pk/9780143454212.jpg",
    "review": "'The Great Gatsby' by F. Scott Fitzgerald is a timeless masterpiece that delves into the decadence and disillusionment of the Jazz Age. Set in the Roaring Twenties, the novel unveils the enigmatic Jay Gatsby's extravagant parties, masking a pursuit of lost love. Narrated by Nick Carraway, the story explores themes of wealth, love, and the American Dream, drawing readers into a vivid portrayal of the glittering yet elusive world of the East and West Egg. Fitzgerald's prose is both poetic and haunting, weaving a compelling narrative that transcends its era. A poignant exploration of societal excess and the human condition, 'The Great Gatsby' remains a literary gem that resonates across generations.",
    "totalPages": 192,
    "rating": 4.5,
    "category": "Classic",
    "tags": [
      "Fiction",
      "Romance"
    ],
    "publisher": "Scribner",
    "yearOfPublishing": 1925
  },
  {
    "bookId": 2,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://i.ibb.co.com/0cv102J/To-Kill-a-Mockingbird.webp",
    "review": "Harper Lee’s To Kill a Mockingbird is a timeless American classic that explores profound themes of justice and prejudice through the innocent eyes of a child, Scout Finch. Set in 1930s Alabama, the story follows her father, the principled lawyer Atticus Finch, as he defends a Black man wrongly accused of a crime.The novel masterfully contrasts the ugliness of racial injustice with the unwavering moral courage of Atticus. It’s a powerful and moving story about empathy, the loss of innocence, and the importance of protecting the vulnerable. Its central lesson—that it’s a sin to kill a mockingbird—remains a vital and unforgettable message for readers of all ages",
    "totalPages": 281,
    "rating": 4.8,
    "category": "Fiction",
    "tags": [
      "Drama",
      "Social Justice"
    ],
    "publisher": "J.B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "bookId": 3,
    "bookName": "1984",
    "author": "George Orwell",
    "image": "https://i.ibb.co.com/MprDyVt/51-BIA4rrae-L-AC-UF1000-1000-QL80.jpg",
    "review": "George Orwell's 1984 is a chilling and timeless warning against the dangers of absolute power. In the dystopian superstate of Oceania, the Party, led by the ever-watchful Big Brother, controls every aspect of life, from history to thought itself. The novel follows Winston Smith's futile struggle for truth and individuality in a world of constant surveillance, propaganda, and psychological manipulation. Orwell's vision of a society where truth is whatever the regime says it is remains a powerful and haunting reminder of the importance of intellectual freedom and the fragility of reality.",
    "totalPages": 328,
    "rating": 4.6,
    "category": "Fiction",
    "tags": [
      "Dystopian",
      "Political"
    ],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "bookId": 4,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://i.ibb.co.com/tYSWRfG/catcherrye-edited-1-800x.png",
    "review": "J.D. Salinger's The Catcher in the Rye is the quintessential novel of teenage angst and alienation. Told in the unforgettable voice of its cynical and disillusioned protagonist, Holden Caulfield, the story follows his journey through New York City after being expelled from prep school. Holden's rebellion against the phony adult world and his search for authenticity have made the novel an enduring classic, capturing the confusing and painful transition from childhood to adulthood for generations of readers.",
    "totalPages": 224,
    "rating": 4.3,
    "category": "Fiction",
    "tags": [
      "Young Adult",
      "Identity"
    ],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": 5,
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://i.ibb.co.com/YdQDMpn/81me-ud-V63-L-AC-UF1000-1000-QL80.jpg",
    "review": "A witty and timeless romance, this novel follows the headstrong Elizabeth Bennet as she navigates societal expectations and clashes with the proud Mr. Darcy. It's a sharp satire of class and manners, celebrated for its sparkling dialogue and enduring love story.",
    "totalPages": 279,
    "rating": 4.7,
    "category": "Classic",
    "tags": [
      "Romance",
      "Satire"
    ],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813
  },
  {
    "bookId": 6,
    "bookName": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://i.ibb.co.com/xS8YvxL/81m-CE-uclx-L-UF1000-1000-QL80.jpg",
    "review": "This enchanting fantasy classic tells the tale of Bilbo Baggins, a comfort-loving hobbit who is swept into an epic adventure to reclaim treasure from a fearsome dragon. It's a charming story of courage, friendship, and discovering the hero within oneself.",
    "totalPages": 310,
    "rating": 4.9,
    "category": "Fantasy",
    "tags": [
      "Adventure",
      "Epic"
    ],
    "publisher": "Allen & Unwin",
    "yearOfPublishing": 1937
  },
  {
    "bookId": 7,
    "bookName": "Harry Potter and the Sorcerer's Stone",
    "author": "J.K. Rowling",
    "image": "https://i.ibb.co.com/989qMRW/42844155.jpg",
    "review": "The magical beginning of a global phenomenon, this book introduces Harry Potter, an orphan who discovers he is a wizard. Whisked away to Hogwarts School of Witchcraft and Wizardry, he finds friendship and confronts the dark forces that haunt his past.",
    "totalPages": 309,
    "rating": 4.8,
    "category": "Fantasy",
    "tags": [
      "Magic",
      "Young Adult"
    ],
    "publisher": "Bloomsbury",
    "yearOfPublishing": 1997
  },
  {
    "bookId": 8,
    "bookName": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://i.ibb.co.com/zS9jsdK/18144590.jpg",
    "review": "An inspiring fable about following your dreams, this story follows Santiago, an Andalusian shepherd boy, on a journey to the Egyptian pyramids in search of treasure. It's a simple yet profound tale about listening to your heart and reading the omens of the universe.",
    "totalPages": 177,
    "rating": 4.6,
    "category": "Fiction",
    "tags": [
      "Philosophical",
      "Adventure"
    ],
    "publisher": "HarperCollins",
    "yearOfPublishing": 1988
  },
  {
    "bookId": 9,
    "bookName": "The Girl on the Train",
    "author": "Paula Hawkins",
    "image": "https://i.ibb.co.com/P6hfCmJ/Whats-App-Image-2024-05-22-at-11-21-25-2e21ae46.jpg",
    "review": "A gripping psychological thriller that unravels through the eyes of an unreliable narrator, Rachel Watson. After witnessing something shocking from her commuter train, she becomes entangled in a missing person's investigation, forcing her to confront her own fractured memories.",
    "totalPages": 316,
    "rating": 4.2,
    "category": "Mystery",
    "tags": [
      "Suspense",
      "Psychological"
    ],
    "publisher": "Riverhead Books",
    "yearOfPublishing": 2015
  }
]